In [1]:
import pandas as pd
import numpy as np

In [2]:
df=pd.read_csv("Dassault system salaries.csv")
df.head()

                           Position Nature    Salary Base Salary    Bonus
0                 Software Engineer    NaN  49 500 €    42 500 €  9 250 €
1                         Ingénieur  STAGE  16 478 €    16 426 €  2 054 €
2                         Stagiaire  STAGE  16 098 €    16 098 €        0
3  Ingénieur Développement Logiciel    NaN  50 800 €    44 845 €  8 829 €
4                     Ingénieur R&D    NaN  50 000 €    43 397 €  8 971 €

In [3]:
df.shape

(800, 5)

In [4]:
df.describe()

                 Position Nature           Salary      Base Salary Bonus
count                 800    286              800              800   800
unique                701      4              369              330   131
top     Software Engineer  STAGE  48 k € - 52 k €  16 k € - 17 k €     0
freq                    4    192               31               27   547

# Dropping positions with unuseful nature

In [5]:
df.drop(df[df.Nature=='STAGE'].index, inplace=True)
df.drop(df[df.Nature=='APPRENTI'].index, inplace=True)
df.drop(df[df.Nature=='STAGIAIRE'].index, inplace=True)
df.drop(df[df.Nature=='INTÉRIMAIRE'].index, inplace=True)
df.shape

(514, 5)

In [6]:
df.describe()

              Position Nature           Salary      Base Salary Bonus
count              514      0              514              514   514
unique             507      0              294              259   116
top     Market Analyst    NaN  48 k € - 52 k €  48 k € - 52 k €     0
freq                 2    NaN               31               24   304

# Nature of position is now permanent

In [7]:
if 'Nature' in df: df.drop('Nature', axis=1, inplace=True)
df.head(2)
df.shape

(514, 4)

# Droping forign currencies

In [8]:
df.drop(df[~df['Salary'].str.contains('€')].index, inplace=True)
df.reset_index(inplace=True, drop=True)
df.shape

(508, 4)

In [11]:
def formating(value):
    return int(value.split('-')[0].replace('\u202f', '').replace(' €', '').replace(' k','000').strip())

In [12]:
df.loc[:,'Salary':]=df.loc[:,'Salary':].applymap(formating)
df.head()

                           Position Salary Base Salary Bonus
0                 Software Engineer  49500       42500  9250
1  Ingénieur Développement Logiciel  50800       44845  8829
2                     Ingénieur R&D  50000       43397  8971
3                         Ingénieur  40000       39431  9142
4                    Data Scientist  49680       43895  8574